//第4节 再解炸弹人 深度优先搜索
var map = [
	['#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'],
	['#', 'G', 'G', '.', 'G', 'G', 'G', '#', 'G', 'G', 'G', '.', '#'],
	['#', '#', '#', '.', '#', 'G', '#', 'G', '#', 'G', '#', 'G', '#'],
	['#', '.', '.', '.', '.', '.', '.', '.', '#', '.', '.', 'G', '#'],
	['#', 'G', '#', '.', '#', '#', '#', '.', '#', 'G', '#', 'G', '#'],
	['#', 'G', 'G', '.', 'G', 'G', 'G', '.', '#', '.', 'G', 'G', '#'],
	['#', 'G', '#', '.', '#', 'G', '#', '.', '#', '.', '#', '.', '#'],
	['#', '#', 'G', '.', '.', '.', 'G', '.', '.', '.', '.', '.', '#'],
	['#', 'G', '#', '.', '#', 'G', '#', '#', '#', '.', '#', 'G', '#'],
	['#', '.', '.', '.', 'G', '#', 'G', 'G', 'G', '.', 'G', 'G', '#'],
	['#', 'G', '#', '.', '#', 'G', '#', 'G', '#', '.', '#', 'G', '#'],
	['#', 'G', 'G', '.', 'G', 'G', 'G', '#', 'G', '.', 'G', 'G', '#'],
	['#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'],
];
var next = [
	[0, 1],
	[1, 0],
	[0, -1],
	[-1, 0]
];

function getnum(x, y) {
	var sum = 0;
	for(var i = 0; i < next.length; i++) {
		var tx = x;
		var ty = y;
		while(map[tx][ty] != '#') {
			if(map[tx][ty] == 'G') {
				sum++;
			}
			tx += next[i][0];
			ty += next[i][1];
		}
	}
	return sum;
}

var startx = starty = 3;
var max = 0,
	p,
	q;
var book = [];
for(var i = 0; i < map.length; i++) {
	book[i] = [];
}
book[startx][starty] = 1;

function bomberDFS(x, y) {
	var num = getnum(x, y);
	if(num > max) {
		max = num;
		p = x;
		q = y;
	}

	for(var i = 0; i < next.length; i++) {
		var tx = x + next[i][0];
		var ty = y + next[i][1];
		if(map[tx][ty] == "." && book[tx][ty] != 1) {
			book[tx][ty] = 1;
			bomberDFS(tx, ty);
		}
	}
}

bomberDFS(startx, starty);
console.log("在(" + p + "," + q + ")处，一共消灭" + max + "个敌人");